dict = {
    "ноль": 0,
    'один': 1,
    "одна": 1,
    "два": 2,
    "две": 2,
    "три": 3,
    "четыре": 4,
    "пять": 5,
    "шесть": 6,
    "семь": 7,
    "восемь": 8,
    "девять": 9,
    "десять": 10,
    "одиннадцать": 11,
    "двенадцать": 12,
    "тринадцать": 13,
    "четырнадцать": 14,
    "пятнадцать": 15,
    "шестнадцать": 16,
    "семнадцать": 17,
    "восемнадцать": 18,
    "девятнадцать": 19,
    "двадцать": 20,
    "тридцать": 30,
    "сорок": 40,
    "пятьдесят": 50,
    "шестьдесят": 60,
    "семьдесят": 70,
    "восемьдесят": 80,
    "девяносто": 90,
    "сто": 100,
    "двести": 200,
    "триста": 300,
    "четыреста": 400,
    "пятьсот": 500,
    "шестьсот": 600,
    "семьсот": 700,
    "восемьсот": 800,
    "девятьсот": 900,
    "тысяча": 1000,
    0:"ноль",
    1: "один",
    2: "два",
    3: "три",
    4: "четыре",
    5: "пять",
    6: "шесть",
    7: "семь",
    8: "восемь",
    9: "девять",
    10: "десять",
    11: "одиннадцать",
    12: "двенадцать",
    13: "тринадцать",
    14: "четырнадцать",
    15: "пятнадцать",
    16: "шестнадцать",
    17: "семнадцать",
    18: "восемнадцать",
    19: "девятнадцать",
    20: "двадцать",
    30: "тридцать",
    40: "сорок",
    50: "пятьдесят",
    60: "шестьдесят",
    70: "семьдесят",
    80: "восемьдесят",
    90: "девяносто",
    100: "сто",
    200: "двести",
    300: "триста",
    400: "четыреста",
    500: "пятьсот",
    600: "шестьсот",
    700: "семьсот",
    800: "восемьсот",
    900: "девятьсот",
    1000: "тысяча"
}
def calc(s):
    arr = s.split()
    itog = ''
    result = 0
    sum = 0
    res = 0
    array = []
    k = 1
    eqal = []
    drob = 0
    i=0
    while i < (len(arr)):
        if dict.setdefault(arr[i]) is not None:
            sum += dict.get(arr[i])
            i += 1

        else:
            if sum != 0:
                eqal.append(sum)
            if sum == 0 and arr[i - 1] == 'ноль':
                eqal.append(sum)
            sum = 0
            drob = 0
            if arr[i] == 'плюс':
                eqal.append('+')
            elif arr[i] == 'минус':
                eqal.append('-')
            elif arr[i] == 'умножить':
                eqal.append('*')
                i+=1

            i += 1
    sum = round((sum), 3)
    eqal.append(sum)

    if '+' in eqal:
        result=int(eqal[0])+int(eqal[-1])
    if '-' in eqal:
        result=int(eqal[0])-int(eqal[-1])
    if '*' in eqal:
        result=int(eqal[0])*int(eqal[-1])

    if result>20 and result%10!=0:
        r1=result-result%10
        r2=result%10
        result=dict.get(r1)+' '+dict.get(r2)
    else:
        result=dict.get(result)

    return (result)

bl=[]
stroka = input()
otvet=calc(stroka)
print(otvet)
